Repository: Daniel-KM/Omeka-S-module-ExtractOcr
Catalog: language/*.po
Languages: fr

source: The directory "%s" is not writeable. Fix rights or create it manually.
fr: Le dossier « %s » n’est pas accessible en écriture. Corrigez les droits ou créez le manuellement.

source: The file "%s" cannot be renamed.
fr: Le dossier « %s » ne peut pas être renommé.

source: The base uri "%s" is not set in the config file of Omeka "config/local.config.php". It must be set for technical reasons for now.
fr: L’uri de base « %s » n’est pas définie dans le fichier de configuration d’Omeka « config/local.config.php ». Il doit être défini pour des raisons techniques pour l’instant.

source: Options are used during edition of items and for bulk processing.
fr: Les options sont utilisées lors de l’édition des contenus et pour le traitement en masse.

source: The insertion of the text in the item properties is currently not supported.
fr: L’insertion du texte dans les propriétés du contenu n’est actuellement pas prise en charge.

source: XML files will be rebuilt for all PDF files of your Omeka install.
fr: Les fichiers XML seront reconstruits pour tous les fichiers PDF de votre installation Omeka.

source: Process
fr: Traitement

source: The base uri is not set (key [file_store][local][base_uri]) in the config file of Omeka "config/local.config.php". It must be set for now (key [file_store][local][base_uri]) in order to process background jobs.
fr: L’uri de base n’est pas définie (clé [file_store][local][base_uri]) dans le fichier de configuration Omeka « config/local.config.php ». Il doit être indiqué (clé [file_store][local][base_uri]) de façon à gérer les tâches en arrière-plan.

source: A new option allows to create xml as alto multi-pages.
fr: Une nouvelle option permet de créer les xml en alto multi-pages.

source: A new option allows to export OCR into tsv format for quicker search results. Data should be reindexed with format TSV.
fr: Une nouvelle option permet d’exporter l’OCR dans un format tsv pour une recherche plus rapide. Les données doivent être réindexées avec le format TSV.

source: A new option allows to store the file separately of the item. You can enable it by default.
fr: Une nouvelle option permet d’enregistrer le fichier séparément du contenu. Vous pouvez l’activer par défaut.

source: It is now possible to store multiple extracted files and medias, for example one for quick search and another one to display transcription.
fr: Il est désormais possible d’enregistrer plusieurs fichiers et médias extraits, par exemple un pour la recherche rapide et un autre pour afficher les transcriptions.

source: In order to manage multiple derivative files and to avoid collisions with native files, the names of the file were updated. You should remove all existing created files (via search media by media type then delete) then recreate them all (via the job in config form).
fr: De façon à gérer plusieurs fichiers dérivés et éviter les collisions avec les noms par défaut, les noms des fichiers ont été modifiés. Vous devez supprimer tous les fichiers créés auparavant (via la recherche des média par type de média) et les recréer ensuite (via la tâche dans la page de configuration).

source: A new extract format was added as tsv to allow quick and exact search, but with larger files.
fr: Un nouveau format d’extraction a été ajouté en tsv pour permettre une recherche rapide et exacte, mais avec des fichiers plus gros.

source: You may update the settings in the %1$sconfig form%2$s.
fr: Vous pouvez mettre à jour les paramètres dans le %1$sformulaire de configuration%2$s.

source: The command-line utility pdftotext is not available. Install the package poppler-utils.
fr: L’utilitaire de ligne de commande pdftotext n'est pas disponible. Le paquet poppler-utils doit être installé.

source: The command-line utility pdftohtml is not available. Install the package poppler-utils.
fr: L’utilitaire de ligne de commande pdftohtml n'est pas disponible. Le paquet poppler-utils doit être installé.

source: No job launched.
fr: Aucune tâche lancée.

source: Creating Extract OCR files in background (job %1$s#%2$s%3$s, %4$slogs%3$s).
fr: Création des fichiers d’extraction OCR en arrière-plan (tâche %1$s#%2$s%3$s, %4$sjournaux%3$s).

source: Extracting OCR in background.
fr: Extraction de l’OCR en arrière-plan.

source: The directory "%s" is not writeable.
fr: Le dossier « %s » n’est pas inscriptible.

source: The directory "%1$s" is not writeable: %2$s.
fr: Le dossier « %1$s » n’est pas accessible en écriture : %2$s.

source: Extract OCR: Extract ocr from files
fr: Extract OCR : extraire l’ocr des fichierse

source: Options to extract OCR
fr: Options pour extraire l’ocr

source: Extract OCR job
fr: Tâche d’extraction OCR

source: Only already extracted (improve extraction)
fr: Seulement les contenus déjà extraits (améliore l’extraction)

source: Only missing extracted medias
fr: Seulement les médias non extraits

source: All medias
fr: Tous les médias

source: Item ids
fr: Identifiants des contenus

source: The temporary directory "files/temp" is not writeable. Fix rights or create it manually.
fr: Le répertoire temporaire « files/temp » n’est pas accessible en écriture. Corrigez les droits ou créez le manuellement.

source: The base uri is unknown.
fr: L’uri de base est inconnue.

source: No extract format to process.
fr: Aucun format à traiter.

source: The php extension "xml" or "xsl" is required to extract text as xml alto.
fr: L’extension php « xml » ou « xsl » est nécessaire pour extraire le texte au format xml alto.

source: The directory is not writeable.
fr: Le dossier ne peut pas être écrit.

source: The option to store text is set, but no property is defined.
fr: L’option de stockage du texte est activée, mais aucune propriété n'est définie.

source: No item with a pdf to process.
fr: Aucun contenu avec un pdf à traiter.

source: Formats of xml files to create: %s.
fr: Formats des fichiers xml à créer : %s.

source: Creating Extract OCR files for %d PDF only if they already exist.
fr: Création des fichiers OCR pour %d PDF, seulement s’ils existent déjà.

source: Creating Extract OCR files for %d PDF, only if they do not exist yet.
fr: Création des fichiers OCR pour %d PDF, seulement s’ils n’existent pas.

source: Creating Extract OCR files for %d PDF, xml files will be overridden or created.
fr: Création de fichiers OCR pour %d PDF, les fichiers xml seront remplacés ou créés.

source: Mode of extraction "%s" is not managed.
fr: Le mode d’extraction « %s » n’est pas géré.

source: Processing format %1$d/%2$d: %3$s (%4$s).
fr: Traitement du format %1$d/%2$d: %3$s (%4$s).

source: End of processing formats.
fr: Fin du traitement des formats.

source: The job "Extract OCR" was stopped: %1$d/%2$d resources processed, %3$d failed (%4$d without file, %5$d without text layer, %6$d with issue).
fr: La tâche « Extraction OCR » a été arrêtée : %1$d/%2$d ressources traitées, %3$d échecs (%4$d sans fichier, %5$d sans couche de texte, %6$d avec problème).

source: The job "Extract OCR" was stopped: %1$d/%2$d resources processed, %3$d skipped, %4$d failed (%5$d without file, %6$d without text layer, %7$d with issue).
fr: La tâche « Extraction OCR » a été arrêtée : %1$d/%2$d ressources traitées, %3$d ignorées, %4$d échouées (%5$d sans fichier, %6$d sans couche de texte, %7$d avec problème).

source: Item #%d: only the first pdf is processed.
fr: Contenu #%d : seul le premier pdf est traité.

source: Index #%1$d/%2$d: Extracting OCR for item #%3$d, media #%4$d "%5$s".
fr: Index #%1$d/%2$d : Extraction de l’OCR pour le contenu #%3$d, média #%4$d « %5$s ».

source: The existing %1$s was removed for item #%2$d.
fr: Le fichier %1$s existant a été supprimé pour le contenu #%2$d.

source: A file %1$s already exists, so item #%2$d is skipped.
fr: Un fichier %1$s existe déjà. Le contenu #%2$d est ignoré.

source: A file %1$s (media #%2$d) already exists, so item #%3$d is skipped.
fr: Un fichier %1$s (média #%2$d) existe déjà. Le contenu #%3$d est ignoré.

source: The output %1$s for pdf #%2$d has no text content and is not created.
fr: Le sortie %1$s pour le pdf #%2$d n'a pas de contenu textuel et n’a pas été créé.

source: Media #%1$d (item #%2$d) created for %3$s file.
fr: Média #%1$d (contenu #%2$d) créé pour le fichier %3$s.

source: IIIF Search file for item #%1$d created for format %2$s.
fr: Fichier pour la recherche IIIF du contenu #%1$d créé pour le format %2$s.

source: Unable to store the IIIF Search file for item #%1$d for format %2$s.
fr: Impossible d’enregistrer le fichier de recherche IIIF pour le contenu #%1$d pour le format %2$s.

source: These medias have no pdf file: #%s
fr: Ces médias n'ont pas de fichier pdf : #%s

source: These pdf files have no text layer: #%s
fr: Ces fichiers pdf n’ont pas de couche de texte : #%s

source: These pdf files have issues when extracting content: #%s
fr: Ces fichiers pdf ont eu des problèmes lors de l'extraction du contenu : #%s

source: Processed %1$d/%2$d pdf files, %3$d files %4$s created, %5$d failed (%6$d without file, %7$d without text layer, %8$d with issue).
fr: Traitement de %1$d/%2$d fichiers pdf, %3$d fichiers %4$s créés, %5$d échoués (%6$d sans fichier, %7$d sans couche de texte, %8$d avec problème).

source: Processed %1$d/%2$d pdf files, %3$d skipped, %4$d files %5$s, created, %6$d failed (%7$d without file, %8$d without text layer, %9$d with issue).
fr: Traitement de %1$d/%2$d fichiers pdf, %3$d ignorés, %4$d fichiers %5$s créés, %6$d échoués (%7$d sans fichier, %8$d sans texte, %9$d avec problème).

source: Missing pdf file (media #%1$d).
fr: Fichier pdf manquant (média #%1$d).

source: File %1$s was not created for media #%2$s.
fr: Le fichier %1$s n’a pas été créé pour le média #%2$s.

source: File cannot be saved in temporary directory "%1$s" (temp file: "%2$s")
fr: Le fichier ne peut pas être enregistré dans le dossier temporaire « %1$s » (fichier : « %2$s »)

source: Create file for formats
fr: Créer des fichiers pour les formats

source: For more info on formats, see readme.
fr: Pour plus d’info sur les formats, consultez le lisez-moi.

source: tsv with original order of words (quick and exact search for iiif search)
fr: tsv avec l’ordre original des mots (recherche rapide et exacte pour recherche iiif)

source: tsv grouped by word (very quick search for iiif search, small index)
fr: tsv par mot groupé (recherche très rapide pour recherche iiif, index léger)

source: xml alto (slow search, ocr transcription for iiif server)
fr: xml alto (recheche lente, ocr transcription pour serveur iiif)

source: Create media for formats
fr: Créer des médias pour les formats

source: tsv with original order of words
fr: tsv avec ordre original des mots

source: tsv grouped by word
fr: tsv par mot groupé

source: Store the raw text in a property of a resource
fr: Stocker le texte brut dans une propriété d’une ressource

source: Text cannot be stored in item when an item is manually edited.
fr: Le texte ne peut pas être stocké dans l’élément lorsqu’un élément est édité manuellement.

source: Pdf media
fr: Médias Pdf

source: Tsv or Xml media if any
fr: Média Tsv ou Xml si présent

source: Property to save pdf raw text (not recommended)
fr: Propriété où enregistrer le texte brut (non recommandé)

source: To save content makes it searchable anywhere. It is recommended to use "bibo:content". Note that it will increase the noise in the results, unless you use a search engine. Furthermore, this option is not recommended when the text is too much big.
fr: L’enregistrement d’un contenu le rend cherchable partout. Il est recommandé d’utiliser « bibo:content ». Notez que cela augmentera le bruit dans les résultats, à moins que vous n’utilisiez un moteur de recherche. De plus, cette option n’est pas recommandé quand le texte est trop grand.

source: Select a media property…
fr: Sélectionner une propriété du média…

source: Language code of the content
fr: Code langue du contenu

source: Create xml file even if there is no text content
fr: Créer un fichier xml même s’il n'y a pas de contenu textuel

source: This option may be useful to keep the same order and number of pages and extracted texts.
fr: Cette option peut être utile pour conserver le même ordre et le même nombre de pages et de textes extraits.

source: Run in background
fr: Lancer en arrière-plan
